SELECT Артикул, Название_детали, Цена, MAX(Количество_заказанных_деталей) [Максимальное кол-во заказанных деталей], COUNT(*) [Сколько раз заказывали товар]
FROM Поставки INNER JOIN Товары
	ON Товар = Артикул
	AND Цена > 5
	GROUP BY Артикул, Название_детали, Цена;

SELECT *
FROM (SELECT CASE WHEN Цена BETWEEN 3 AND 7 THEN 'Дешевый товар'
      WHEN Цена BETWEEN 7 AND 9 THEN 'Средний по цене товар'
	  ELSE 'Дорогой товар'
	  END [Пределы цен], COUNT(*)[Количество]
FROM Товары GROUP BY CASE
	  WHEN Цена BETWEEN 3 AND 7 THEN 'Дешевый товар'
      WHEN Цена BETWEEN 7 AND 9 THEN 'Средний по цене товар'
	  ELSE 'Дорогой товар'
	  END) AS T
		ORDER BY CASE [Пределы цен]
		  WHEN 'Дешевый товар' THEN 3
		  WHEN 'Средний по цене товар' THEN 2
		  WHEN 'Дорогой товар' THEN 1
		  ELSE 0
		  END DESC;

SELECT Артикул, Название_детали, ROUND(AVG(CAST(Количество_заказанных_деталей AS FLOAT(2))), 2) [Среднее кол-во заказанных деталей]
FROM Поставки INNER JOIN Товары
	ON Товар = Артикул
	WHERE Цена > 5
	GROUP BY Артикул, Название_детали;

SELECT Артикул, SUM(Количество_заказанных_деталей) [Общая сумма заказанных деталей]
FROM Поставки
	WHERE Артикул IN ('UEE009', 'PRD002', 'PRD003')
	GROUP BY Артикул;

SELECT Артикул, SUM(Количество_заказанных_деталей) [Общая сумма заказанных деталей]
FROM Поставки
	WHERE Количество_заказанных_деталей > 50
	GROUP BY Артикул
	HAVING SUM(Количество_заказанных_деталей) > 200
	ORDER BY [Общая сумма заказанных деталей] DESC;