SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Дата_заказа BETWEEN '2024-01-01' AND '2024-12-31'
	GROUP BY ROLLUP (Артикул);

SELECT Артикул, Код_поставщика, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Количество_заказанных_деталей <= 150
	GROUP BY CUBE (Артикул, Код_поставщика);

SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'PRD002')
	GROUP BY Артикул
UNION
SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'JEK022', 'UEE009')
	GROUP BY Артикул;

SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'PRD002')
	GROUP BY Артикул
UNION ALL
SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'JEK022', 'UEE009')
	GROUP BY Артикул;

SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'PRD002')
	GROUP BY Артикул
INTERSECT
SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'JEK022', 'UEE009')
	GROUP BY Артикул;

SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'PRD002')
	GROUP BY Артикул
EXCEPT
SELECT Артикул, SUM(Количество_заказанных_деталей)[Кол-во]
FROM Поставки
	WHERE Артикул IN ('PRD001', 'PRD003', 'JEK022', 'UEE009')
	GROUP BY Артикул;